# https://github.com/Homebrew/homebrew-bundle

brew 'python' # Use brew version of python instead of macOS one
brew 'fzf'
brew 'hub'
brew 'tig'
brew 'zsh-syntax-highlighting'
brew 'difftastic'
brew 'ripgrep' # rg
brew 'tldr' # short info about shell commands
brew 'vim' # macOS vim doesn't support powerline status
brew 'trash'
brew 'ripgrep-all' # ripgrep, but also search in PDFs, E-Books, Office documents, zip, tar.gz
brew 'poppler' # needed to search inside pdf files with ripgrep-all (rga)
brew 'bat' # a cat clone with syntax highlight and git support
brew 'fd' # a simple, fast and user-friendly alternative to find
brew 'shellcheck' # a static analysis tool for shell scripts
brew 'httpie' # human-friendly CLI HTTP client
brew 'yq' # a lightweight and portable command-line YAML, JSON and XML processor
brew 'jq' # a lightweight and flexible command-line JSON processor
brew 'ssed' # super sed stream editor
brew 'sd' # an intuitive find & replace CLI https://github.com/chmln/sd
brew 'wget'
brew 'broot' # A better way to navigate directories https://github.com/Canop/broot
brew 'tree'
brew 'pure' # Pretty, minimal and fast ZSH prompt https://github.com/sindresorhus/pure
brew 'ffmpeg'
